/* NSExecutableNotLoadableError */
"BundleErr3584" = "ชุดรวม “%@” โหลดไม่ได้เนื่องจากหาส่วนปฏิบัติการโหลดไม่ได้";

/* NSExecutableNotLoadableError */
"BundleErr3584-C" = "ส่วนปฏิบัติการของชุดรวมโหลดไม่ได้";

/* NSExecutableNotLoadableError */
"BundleErr3584-R" = "ลองติดตั้งชุดรวมอีกครั้ง";

/* NSExecutableArchitectureMismatchError */
"BundleErr3585" = "ไม่สามารถโหลดชุดรวม “%@” ได้เนื่องจากไม่มีเวอร์ชั่นสำหรับโครงสร้างที่ใช้ในปัจจุบัน";

/* NSExecutableArchitectureMismatchError */
"BundleErr3585-C" = "ชุดรวมไม่มีเวอร์ชั่นสำหรับโครงสร้างที่ใช้ในปัจจุบัน";

/* NSExecutableArchitectureMismatchError */
"BundleErr3585-R" = "ลองติดตั้งเวอร์ชั่นสากลของชุดรวม";

/* NSExecutableRuntimeMismatchError */
"BundleErr3586" = "ไม่สามารถโหลดชุดรวม “%@” ได้เนื่องจากไม่รองรับกับแอปพลิเคชั่นปัจจุบัน";

/* NSExecutableRuntimeMismatchError */
"BundleErr3586-C" = "ชุดรวมไม่รองรับกับแอปพลิเคชั่นนี้";

/* NSExecutableRuntimeMismatchError */
"BundleErr3586-R" = "ลองติดตั้งเวอร์ชั่นใหม่กว่าของชุดรวม";

/* NSExecutableLoadError */
"BundleErr3587" = "ไม่สามารถโหลดชุดรวม “%@” เนื่องจากเสียหายหรือขาดแหล่งข้อมูลที่จำเป็น";

/* NSExecutableLoadError */
"BundleErr3587-C" = "ชุดรวมเสียหายหรือไม่มีแหล่งข้อมูลที่จำเป็น";

/* NSExecutableLoadError */
"BundleErr3587-R" = "ลองติดตั้งชุดรวมอีกครั้ง";

/* NSExecutableLinkError */
"BundleErr3588" = "ไม่สามารถโหลดชุดรวม “%@”";

/* NSExecutableLinkError */
"BundleErr3588-C" = "ไม่สามารถโหลดชุดรวม";

/* NSExecutableLinkError */
"BundleErr3588-R" = "ลองติดตั้งชุดรวมอีกครั้ง";

/* NSFileNoSuchFileError */
"BundleErr4" = "ชุดรวม “%@” โหลดไม่ได้เนื่องจากหาส่วนปฏิบัติการไม่พบ";

/* NSFileNoSuchFileError */
"BundleErr4-C" = "หาส่วนปฏิบัติการของชุดรวมไม่ได้";

/* NSFileNoSuchFileError */
"BundleErr4-R" = "ลองติดตั้งชุดรวมอีกครั้ง";

/* Name of the 'Cocoa' error domain when showing to user. Very likely this will not get localized. */
"NSCocoaErrorDomain" = "Cocoa";

/* Name of the 'Core Foundation' error domain when showing to user. Very likely this will not get localized differently in other languages. */
"NSCoreFoundationErrorDomain" = "Core Foundation";

/* Name of the 'Mach' error domain when showing to user. This probably will not get localized, unless there is a generally recognized phrase for 'Mach' in the language. */
"NSMachErrorDomain" = "Mach";

/* Name of the 'OSStatus' error domain when showing to user. Very likely this will not get localized. */
"NSOSStatusErrorDomain" = "OSStatus";

/* Name of the 'POSIX' error domain when showing to user. This probably will not get localized, unless there is a generally recognized phrase for 'POSIX' in the language. */
"NSPOSIXErrorDomain" = "POSIX";

/* A generic error string indicating there was a problem. The %@ will be replaced by a second sentence which indicates why the operation failed. */
"The operation couldn\\U2019t be completed. %@" = "ไม่สามารถดำเนินการให้เสร็จสิ้นได้ %@";

/* A generic error string indicating there was a problem, followed by a parenthetical sentence which indicates error domain, code, and a description when there is no other way to present an error to the user. The first %@ indicates the error domain, %ld indicates the error code, and the second %@ indicates the description; so this might become '(Mach error 42 - Server error.)' for instance. */
"The operation couldn\\U2019t be completed. (%@ error %ld - %@)" = "ไม่สามารถดำเนินการให้เสร็จสิ้นได้ (%1$@ ข้อผิดพลาด %2$ld - %3$@)";

/* A generic error string indicating there was a problem, followed by a parenthetical sentence which indicates error domain and code when there is no other way to present an error to the user. The %@ indicates the error domain while %ld indicates the error code; so this might become '(Mach error 42.)' for instance. */
"The operation couldn\\U2019t be completed. (%@ error %ld.)" = "ไม่สามารถดำเนินการให้เสร็จสิ้นได้ (%1$@ ข้อผิดพลาด %2$ld)";

